baotrinhnz/xiaozhi-esp32/main/boards/espressif/esp-vocat/esp_vocat.cc
    // Fetch+decode blocking vài giây -> KHÔNG chạy trong callback MCP (task chính); đẩy sang task riêng.
    struct PanelFetchReq { EspVocat* self; char url[200]; };
    static void PanelFetchTask(void* arg) {
        auto* rq = static_cast<PanelFetchReq*>(arg);
        rq->self->FetchUrlAndShow(rq->url);
        free(rq);
        vTaskDelete(nullptr);
    }

    // Đăng ký tool MCP: brain (khi user "Mèo cho xem lịch") gọi -> hiện panel của người chỉ định.
    void InitializeTools() {
        auto& mcp = McpServer::GetInstance();
        mcp.AddTool(
            "self.screen.show_panel",
            "Hiển thị trang thông tin của một người lên màn hình. Tham số person = tên người "
            "(vd Ja, Men), view = loại trang (calendar/weather/clock).",
            PropertyList({
                Property("person", kPropertyTypeString),
                Property("view", kPropertyTypeString, std::string("calendar")),
            }),
            [this](const PropertyList& properties) -> ReturnValue {
                std::string person = properties["person"].value<std::string>();
                std::string view = properties["view"].value<std::string>();
                auto* rq = static_cast<PanelFetchReq*>(malloc(sizeof(PanelFetchReq)));
                if (rq == nullptr) return false;
                rq->self = this;
                snprintf(rq->url, sizeof(rq->url), "%s/panel?person=%s&view=%s",
                         PANEL_HOST, person.c_str(), view.c_str());
                xTaskCreatePinnedToCore(PanelFetchTask, "panel_fetch", 4 * 1024, rq, 5, nullptr, 0);
                return true;
            });
    }

    void OnTouchStart(int x, int y) {
        touch_t0_ = (uint32_t)(esp_timer_get_time() / 1000);
        touch_sx_ = touch_lx_ = x;
        touch_sy_ = touch_ly_ = y;
    }

    void OnTouchMove(int x, int y) { touch_lx_ = x; touch_ly_ = y; }

    void OnTouchEnd() {
        int dx = touch_lx_ - touch_sx_, dy = touch_ly_ - touch_sy_;
        const int SW = 45;                                  // ngưỡng vuốt (px)
        auto& app = Application::GetInstance();
        auto* disp = dynamic_cast<emote::EmoteDisplay*>(display_);
        if (abs(dx) >= SW && abs(dx) >= abs(dy)) {          // vuốt NGANG -> vào/đổi page
            if (!panel_active_) panel_n_ = 0;
            else panel_n_ += (dx < 0 ? 1 : -1);             // vuốt trái = trang kế, phải = trang trước
            FetchAndShowPanel(panel_n_);
        } else if (dy <= -SW && abs(dy) > abs(dx)) {        // vuốt LÊN -> thoát panel
            if (panel_active_ && disp) { disp->HidePanel(); panel_active_ = false; }
        } else {                                            // CHẠM (di chuyển nhỏ)
            if (panel_active_ && disp) {                    // đang xem panel -> chạm để thoát
                disp->HidePanel(); panel_active_ = false;
            } else if (app.GetDeviceState() == kDeviceStateStarting) {
                EnterWifiConfigMode();
            } else {
                app.ToggleChatState();                      // chạm thường = nói chuyện (như cũ)
            }
        }
    }

    static void touch_event_task(void* arg) {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad == nullptr) {
            ESP_LOGE(TAG, "Invalid touchpad pointer in touch_event_task");
            vTaskDelete(NULL);
            return;
        }

        while (true) {
            if (touchpad->WaitForTouchEvent()) {
                auto& board = (EspVocat&)Board::GetInstance();

                ESP_LOGD(TAG, "Touch event, TP_PIN_NUM_INT: %d", gpio_get_level(TP_PIN_NUM_INT));
                touchpad->UpdateTouchPoint();
                auto touch_event = touchpad->CheckTouchEvent();
                const auto& tpt = touchpad->GetTouchPoint();

                if (touch_event == Cst816s::TOUCH_PRESS) {
                    board.OnTouchStart(tpt.x, tpt.y);
                } else if (touch_event == Cst816s::TOUCH_HOLD) {
                    board.OnTouchMove(tpt.x, tpt.y);
                } else if (touch_event == Cst816s::TOUCH_RELEASE) {
                    board.OnTouchEnd();       // quyết định: vuốt page / thoát / chạm nói chuyện
                }
            }
        }
    }

    void InitializeCharge() {
        charge_ = new Charge(i2c_bus_, 0x55);
        was_charging_ = charge_->IsCharging();
        xTaskCreatePinnedToCore(battery_task, "batteryTask", 3 * 1024, this, 6,
                                &charge_task_handle_, 0);
    }

    void InitializeCst816sTouchPad() {
        cst816s_ = new Cst816s(i2c_bus_, 0x15);

        xTaskCreatePinnedToCore(touch_event_task, "touch_task", 4 * 1024, cst816s_, 5,
                                &touch_task_handle_, 1);

        const gpio_config_t int_gpio_config = {.pin_bit_mask = (1ULL << TP_PIN_NUM_INT),
                                               .mode = GPIO_MODE_INPUT,
                                               // .intr_type = GPIO_INTR_NEGEDGE
                                               .intr_type = GPIO_INTR_ANYEDGE};
        gpio_config(&int_gpio_config);
        gpio_install_isr_service(0);
        gpio_intr_enable(TP_PIN_NUM_INT);
        gpio_isr_handler_add(TP_PIN_NUM_INT, EspVocat::touch_isr_callback, cst816s_);
    }

    void InitializeBmi270() {
        esp_err_t imu_ret = Bmi270Motion::Initialize(shared_i2c_bus_handle_);
        if (imu_ret == ESP_OK) {
            bmi270_ready_ = true;
            xTaskCreatePinnedToCore(imu_event_task, "imu_task", 4 * 1024, this, 4,
                                    &imu_task_handle_, 1);
        } else {
            ESP_LOGW(TAG, "BMI270 unavailable, shake emotion disabled");
        }
    }

#if ESP_VOCAT_ENABLE_CAP_TOUCH_SENSOR
    static uint32_t TouchChannelFromPadGpio(gpio_num_t gpio) {
        if (gpio == GPIO_NUM_NC) {
            return 0;
        }
        if (gpio >= GPIO_NUM_1 && gpio <= GPIO_NUM_14) {
            return static_cast<uint32_t>(gpio);
        }
        return 0;
    }

    static void touch_slider_event_callback(touch_slider_handle_t handle,
                                            touch_slider_event_t event, int32_t data,
                                            void* cb_arg) {
        (void)handle;
        auto* self = static_cast<EspVocat*>(cb_arg);
        if (self == nullptr || self->display_ == nullptr) {
            return;
        }
        if (event != TOUCH_SLIDER_EVENT_POSITION) {
            ESP_LOGI(TAG, "Touch slider evt=%d data=%" PRId32, static_cast<int>(event), data);
        }

